/*
 * To change this license header, choose License Headers in Project Properties.
 * To change this template file, choose Tools | Templates
 * and open the template in the editor.
 */
package skripsi_ihtiaralfath;

import java.util.Objects;

/**
 *
 * @author User
 */
public class ascii_RC4A {
    
    Character[] tabel;

    ascii_RC4A() {
        this.tabel = new Character[]{'\'','ǋ','ǌ','Ũ','ũ','Ū','ū','Ŭ','ŭ','Ů','\\',
            'Ű','ű','ǅ','ǆ','ǉ','Ǐ','ǐ','Ǒ','Š','š','Ǉ','ǈ','Ţ','ţ','Ť','ť','Ŧ','ŧ',
            'ſ','Ǎ','ǎ',' ','!','"','#','$','%','&','Ξ','(',')','*','+',',','-','.',
            '/','0','1','2','3','4','5','6','7','8','9',':',';','<','=','>','?','@',
            'A','B','C','D','E','F','G','H','I','J','K','L','M','N','O','P','Q','R',
            'S','T','U','V','W','X','Y','Z','[','θ',']','^','_','`','a','b','c','d',
            'e','f','g','h','i','j','k','l','m','n','o','p','q','r','s','t','u','v',
            'w','x','y','z','{','|','}','~','ǒ','Ǔ','ǔ','Ϋ','ά','Ǖ','ǖ','Ǘ','ǘ','Ǚ',
            '˯','˲','˳','ͻ','ͼ','σ','τ','υ','έ','ή','ί','ΰ','˰','˱','‰','ʀ','‡','†',
            'ʡ','ƒ','Ɣ','ψ','Ž','ž','¡','¢','£','¤','¥','¦','§','¨','©','ª','«','¬',
            'Œ','®','¯','°','±','²','³','´','µ','¶','•','¸','¹','º','»','¼','½','¾',
            '¿','À','Á','Â','Ã','Ä','Å','Æ','Ç','È','É','Ê','Ë','Ì','Í','Î','Ï','Ð',
            'Ñ','Ô','Õ','Ö','Ò','Ó','×','Ø','Ù','Ú','Û','Ü','Ý','Þ','ß','â','ã','ä',
            'å','à','á','æ','ç','è','é','ê','ë','ì','í','î','ï','ð','ñ','õ','ö','ò',
            'ó','ô','÷','ø','ù','ú','û','ü','ý','þ','ÿ'};
    }
    
    public int getDesimal(Character x) 
    { 
        for (int i= 0; i < 256; i++) {
            if (Objects.equals(x, this.tabel[i])) 
                return i;
        } 
        return 0;
    } 
    
    public char getChar(int x) { 
        return tabel[x];
    }    
}
